app/views/posts/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 976965634]]
---
        <h4><%= post.created_at.strftime('%B %d %Y, %l:%M%P') %></h4>
        <h6>by <strong><%= post.user.last_name.blank? ? "#{post.user.first_name.to_s}" : post.user.first_name %></strong></h6>