app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(comment_params)
    @post = Post.find params[:post_id]
    @comment.post = @post
    @comment.user = current_user
    if @comment.save
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 590023555]]
INSERT INTO "comments" ("body", "post_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "comment 1\r\n"], ["post_id", 590023555], ["user_id", 976965634], ["created_at", "2016-10-16 19:46:37.862090"], ["updated_at", "2016-10-16 19:46:37.862090"]]