app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    @post.user = current_user
    if @post.save
---
INSERT INTO "posts" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

  def show
    @comment=Comment.all
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 143460118]]